
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

100-student Stata lab perpetual license:
       Serial number:  401506209499
         Licensed to:  mac
                       

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  Maximum number of variables is set to 5000; see help set_maxvar.


running /Applications/Stata15/profile.do ...

   
         =============================================
         
                    Hello World! Hello Stata!

         =============================================

Stata官网： [Stata.com]    [Stata-FAQ]       [Stata-Blogs]    [Stata-资源链接] 

Stata论坛： [Stata-list]   [Stack-Overflow]  [经管之家-人大论坛] 
Stata资源： [Stata连享会-简书]     [Stata连享会-知乎]     [Stata连享会-码云] 
            [Stata书单]            [Stata资源汇总] 
Stata课程： [UCLA在线课程]         [Princeton在线课程] 

Stata现场： [Stata初级班]        [Stata高级班]        [Stata优酷视频] 
学术论文：  [学术搜索]        [CNKI]        [百度学术]          [Super Link] 



   
路径直达:  stata | myda | mydo | test  | notes  | micus | guojin |
相关教程:  lec18 | lian | chen | zhang | rumen  | train | econom |
command cdout is unrecognized
r(199);

. do /Users/mac/.ipython/stata/code.do 

. clear

. set more off

. set linesize 200

. log using "/Users/mac/.ipython/stata/log_output.log", text replace
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/mac/.ipython/stata/log_output.log
  log type:  text
 opened on:   4 Sep 2022, 02:34:17

. sysuse auto.dta
(1978 Automobile Data)

. graph twoway scatter trunk price

. 
. log close
      name:  <unnamed>
       log:  /Users/mac/.ipython/stata/log_output.log
  log type:  text
 closed on:   4 Sep 2022, 02:34:18
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. graph display 

. graph export "/Users/mac/myPrograme/work_space/test/Matlab/temp_graph.pdf", replace
(file /Users/mac/myPrograme/work_space/test/Matlab/temp_graph.pdf written in PDF format)

. 
. 
end of do-file
